app/controllers/listings_controller.rb

INSERT INTO "listings" ("name", "desciption", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test Listing"], ["desciption", "This is just a test"], ["price", 1.0], ["created_at", "2015-11-18 01:24:50.267128"], ["updated_at", "2015-11-18 01:24:50.267128"]]
---
  def create
    @listing = Listing.new(listing_params)

    respond_to do |format|
      if @listing.save

UPDATE "listings" SET "desciption" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["desciption", "This is just a test. Revision"], ["updated_at", "2015-11-18 01:25:23.676145"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @listing.update(listing_params)